app/controllers/index_controller.rb

  def search
    if params[:address].empty?
      redirect_to :action => "index"
    else
      payload = make_payload(params[:address])

      @address = params[:address]

      @lat = payload["results"][0]["geometry"]["location"]["lat"]
      @lng = payload["results"][0]["geometry"]["location"]["lng"]

      @incidents = Incident.all
---
SELECT  "incidents".* FROM "incidents" ORDER BY "incidents"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def submit_incident
    payload = make_payload(params[:address])

    lat = payload["results"][0]["geometry"]["location"]["lat"]
    lng = payload["results"][0]["geometry"]["location"]["lng"]
    desc = params[:description]
    address = params[:address]

    Incident.create(:latitude => lat, :longitude => lng, :description => desc, :address => address)
---
INSERT INTO "incidents" ("latitude", "longitude", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["latitude", 41.938725], ["longitude", -87.65024799999999], ["description", "fd"], ["created_at", "2018-05-17 19:28:23.182507"], ["updated_at", "2018-05-17 19:28:23.182507"]]

  def see_incident
    @incident = Incident.find(params[:id])
---
SELECT  "incidents".* FROM "incidents" WHERE "incidents"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]